{
  "name": "Matt Currier",
  "bio": "A versatile engineering leader and software eclecticist with a passion for innovation and music. Currently a Director of Engineering, Matt combines expertise in control systems, full stack development, embedded systems, and IT infrastructure with an R&D mindset. His background spans engineering leadership, firmware and PLC development, and professional musicianship, reflecting an ethos of creativity meets technology.",
  "level": 7,
  "xp": 12000,
  "skills": [
    "Control Systems",
    "Full Stack Development",
    "Embedded Systems",
    "IT Infrastructure",
    "Firmware Development",
    "PLC Programming",
    "Engineering Leadership",
    "Research & Development",
    "Music Technology"
  ],
  "projects": [
    {
      "title": "Poemia",
      "description": "An innovative music interface product enabling unique forms of musical expression. Designed and prototyped custom hardware and firmware for a novel instrument that blends creative performance with technology.",
      "tags": [
        "Music Interface",
        "Hardware",
        "Firmware",
        "Interactive Art"
      ]
    },
    {
      "title": "Spectrum",
      "description": "An audio-reactive lighting system that visualizes sound through dynamic LED displays. Real-time audio spectrum analysis drives immersive lighting effects for music performances and installations.",
      "tags": [
        "Audio Reactive",
        "LED Lighting",
        "Embedded Control",
        "Visualization"
      ]
    },
    {
      "title": "OsteoStrong Automation Systems",
      "description": "Developed fitness automation systems for OsteoStrong’s osteogenic loading equipment. Integrated sensors, PLCs, and software to automate strength training devices, improving safety and tracking performance data.",
      "tags": [
        "Fitness Tech",
        "Automation",
        "PLC",
        "Control Systems"
      ]
    },
    {
      "title": "MCP/Codex Enterprise Architecture",
      "description": "Led an enterprise architecture initiative combining Model Context Protocol (MCP) with AI code generation (Codex). Built a platform to streamline enterprise software development by integrating AI-driven tools into the workflow.",
      "tags": [
        "Enterprise Architecture",
        "AI Integration",
        "Software Development"
      ]
    }
  ],
  "experience": [
    {
      "company": "MCPCodex (AI Platform Startup)",
      "title": "Director of Engineering",
      "dates": "2022 - Present",
      "responsibilities": "Leading the engineering team and R&D efforts for an AI-powered development platform. Architecting solutions that integrate model context protocols and AI (Codex) to automate and enhance software development workflows."
    },
    {
      "company": "OsteoStrong",
      "title": "Lead Automation Engineer (Consultant)",
      "dates": "2018 - 2020",
      "responsibilities": "Designed and implemented automated control systems for OsteoStrong’s bone-strengthening equipment. Developed firmware and PLC programs to control high-impact training devices, improving safety features and data collection."
    },
    {
      "company": "Independent Projects",
      "title": "Founder & Engineer",
      "dates": "2015 - 2018",
      "responsibilities": "Pursued independent tech projects including 'Poemia' and 'Spectrum'. Handled end-to-end development from concept to prototype, covering hardware design, software/firmware development, and integration of creative feedback."
    }
  ],
  "education": [
    {
      "degree": "B.S. in Electrical Engineering",
      "institution": "University of XYZ",
      "year": 2010
    }
  ],
  "achievements": [],
  "badges": [
    "GitHub Arctic Code Vault Contributor",
    "Starstruck (GitHub Stars x4)",
    "Open Source Contributor",
    "Professional Musician"
  ],
  "links": {
    "GitHub": "https://github.com/fingerskier",
    "LinkedIn": "https://linkedin.com/in/matt-currier",
    "Bandcamp": "https://bandcamp.com/mattcurrier"
  }
}
